WebAutomationAssignment/ReportsJMeter/StressTest_5_1/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 3366,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8162.944741532987,
    "medianResTime" : 9047.0,
    "minResTime" : 296.0,
    "maxResTime" : 18098.0,
    "pct1ResTime" : 9422.0,
    "pct2ResTime" : 9512.0,
    "pct3ResTime" : 9793.579999999998,
    "throughput" : 10.886791598475979,
    "receivedKBytesPerSec" : 10.42963140439935,
    "sentKBytesPerSec" : 2.7535927968801546
  },
  "Login Test" : {
    "transaction" : "Login Test",
    "sampleCount" : 3366,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 8162.944741532987,
    "medianResTime" : 9047.0,
    "minResTime" : 296.0,
    "maxResTime" : 18098.0,
    "pct1ResTime" : 9422.0,
    "pct2ResTime" : 9512.0,
    "pct3ResTime" : 9793.579999999998,
    "throughput" : 10.886791598475979,
    "receivedKBytesPerSec" : 10.42963140439935,
    "sentKBytesPerSec" : 2.7535927968801546
  }
}